/*
Напишіть функцію, яка прийматиме масив з іменами, і повертатиме масив, але вже з віддаленими небажаними іменами.
Масив із небажаними іменами має бути всередині вашої функції: const unwantedNames = [“Дима”, “Саша”, ”Ольга”, ”Микита”].
 Приклад коду:
   example(['Микита', 'Саша', 'Анастасія', 'Дима', 'Санич', 'Ольга', ]) => [Анастасія','Санич']
   example(['Олексій', 'Семен', 'Василиса', 'Діма', 'Максим', 'Ольга', ]) => ['Олексій','Семен','Василиса','Максим']
   example(['Алішер', 'Ольга', ]) => ['Алішер']
*/
function filteredNames(arrNames){
    const unwantedNames = ['Дима', 'Саша', 'Ольга', 'Микита'];
    let resultArr=[];
    arrNames.forEach(function (name) {
        if (!unwantedNames.includes(name)) resultArr.push(name)
    });
    return resultArr;
}
    console.log(filteredNames(['Микита', 'Саша', 'Анастасія', 'Дима', 'Санич', 'Ольга', ]));
    console.log(filteredNames(['Олексій', 'Семен', 'Василиса', 'Діма', 'Максим', 'Ольга', ]));
    console.log(filteredNames(['Алішер', 'Ольга', ]));